{
	"latest_addon": [4, 0, 14],
	"latest_cpacks": {
		"Base Humans": [4, 1],
		"Base Clothes": [4, 1],
		"Base Hair": [4, 1],
		"Base Poses": [4, 0],
		"Extra Outfits": [3, 0]
	},
	"required_cpacks": {
		"[2, 0]": {
			"Base Humans": [2, 4],
			"Base Clothes": [2, 1]
		},
		"[3, 0]": {
			"Base Humans": [3, 0],
			"Base Clothes": [3, 0],
			"Extra Outfits": [3, 0]
		},
		"[4, 0]": {
			"Base Humans": [4, 0],
			"Base Clothes": [4, 0],
			"Base Hair": [4, 0]
		}
	},
	"addon_updates": {
		"4, 0, 14": {
			"Features": [
				"This is the official V4 release of Human Generator! If you're already using v4.0.13 this update is just a formality, it only adds tab renaming. For everyone on an older version, this is what's new:",
				"No more creation/finalize phase restriction!",
				"Now all functionality is available at any time! You can for example still change the body proportions and height of the human after adding clothing.",
				"New age system!",
				"You can now make your humans look older and younger than you could before, with full body ageing.",
				"More varied starting humans.",
				"These new options will allow you to have more defined characters more quickly.",
				"Super powerful new API.",
				"Basically the whole add-on now runs on a behind the scenes API. This means almost every functionality of the add-on is quickly accessible through our new Human class.",
				"7 new hair systems intended for aged humans.",
				"Automatic haircards generation.",
				"For when you want to use the humans in software that doesn't support particle hair, or you find particle hair to be too heavy for your use case.",
				"LOD generation.",
				"Want to have lower resolution meshes? Use our new LOD generation feature, found in the processing menu.",
				"And more \"Process\" tools!",
				"Like custom scripts using our new API, renaming objects, materials, bones etc.",
				"Other big changes.",
				"New interface.",
				"To accommodate the many options you have now the creation/finalize phase are gone, we reworked the interface to give you quicker access.",
				"Batch Humans are now fully editable.",
				"You can change anything you can on a regular human.",
				"Many new body proportion sliders.",
				"Like muscles, limb lengths and even stylized characters!",
				"New eye sliders.",
				"Like eye scale, eye distance, eye depth.",
				"And much more!",
				"Save almost every edit as a starting human, including hair, clothing, body changes etc.",
				"Save your own custom diffuse textures",
				"Much easier saving of shape keys to the library",
				"Improved way of adding custom clothing",
				"Manage custom content (delete, edit, etc.) with the Content Overview",
				"Much wider ranges for sliders. Almost every slider can be pushed from -10 to +10"
			],
			"Bugfixes": [
				"Too many to count."
			]	
		},
		"3, 0, 3": {
			"Features": [
				"This is a hotfix release for Blender 3.2, no features are included."
			],
			"Bugfixes": [
				"Fixed an error that occurred during batch generation",
				"Fix for renamed icon in Blender 3.2, which caused the eyebrows panel not to show up."
			]
		},		
		"3, 0, 2": {
			"Features": [
				"Human Generator V3 is here! It's a free update for everyone that owns a copy of Human Generator!",
				"New 'Batch Mode': Quickly generate a lot of humans at once, configurable with settings.",
				"The batch mode includes settings for very optimised humans, so you can have a lot in your scene with minimal slowdown.",
				"Many new hairstyles and many updated hairstyles! We also included more long hairstyles.",
				"Improved hair shader with more realistic color and support for dyed hair",
				"Human Generator Python API! You can now control Human Generator with Python.",
				"New documentation page. We are still working on this one, but you can already visit in by going to humgen3d.com and going to support.",
				"Many new poses to go along with the batch mode!",
				"New corrective shapekey to correct for the knees getting too thin when turned 90 degrees or further.",
				"Tips & Suggestions interface right inside Blender. We will keep adding more tips here over time."
				],
			"Bugfixes": [
				"Many small bugfixes, I kind of lost count."
				]
			},		
		"2, 0, 9": {
			"Features": [
				"New 'Extra outfits' content pack with more female specific outfits and more special outfits",
				"The 2.0.9 add-on update and HG_CP_Extra_Outfits are required downloads for the new extra outfits pack"
				],
			"Bugfixes": [
				"Custom clothing deformed incorrectly (you have to re-save custom clothing for this fix to be effective)"
				]
			},
		"2, 0, 8": {
			"Features": [
				"New universal hair shader that works in Eevee and Cycles. You can switch shaders in the hair material section",
				"Added button in developer tools for adding new hair shader to humans created with earlier versions"
				],
			"Bugfixes": [
				"Tongue not working on Rigify face rig",
				"1-Click expressions reset the body shape when clothing was loaded before",
				"Apply modifiers operator removed the ARKit shape keys even when keep-shapekeys was selected",
				"Multiple bugfixes for custom clothing creation",
				"The face rig for Rigify bones could move in all directions instead of just their active axis",
				"Weird results when you added the face rig after already having 1-click expressions",
				"The hair section in the finalize phase wouldn't show up if only eyebrows and eyelashes were present"
				]
			},
		"2, 0, 7": {
			"Features": [
				"Full release version of Human Generator V2",
				"More efficient memory management (purging unused meshes and textures)",
				"Added 'Prepare for ARKit' operator",
				"Updated QuickStart tutorial",
				"Added ARKit tutorial in Facial Rig section",
				"Added tutorials for making custom content and cpack editor",
				"Added saturation slider for skin textures",
				"Add ability to add geometry masks in Mesh->Cloth panel"
				],
			"Bugfixes": [
				"Individual scaling sliders are now refreshed automatically",
				"Hair thubnails now saved in the correct place",
				"Fixes for 'Save custom outfits' operators",
				"Fixed some hidden console warnings and errors"
				]
			},
		"2, 0, 4": {
			"Features": [
				"New starting humans",
				"10 new face texture sets",
				"Content pack creator/editor"
				],
			"Bugfixes": [
				"Saving custom shapekeys not working",
				"Length changing made the human float",
				"Click here to select icon not loading",
				"Console warnings and errors about preview collections"
				]
			}
	}
}
